#!/bin/bash

apres()
{
	clear
	echo -e "\033[01;31m"
	echo "
  _____      _               _____                      _ _          ___   ___   ___   ___  
 / ____|    | |             / ____|                    (_) |        / _ \ / _ \ / _ \ / _ \ 
| |    _   _| |__   ___ _ _| (___   ___  ___ _   _ _ __ _| |_ _   _| | | | | | | | | | | | |
| |   | | | | '_ \ / _ \ '__\___ \ / _ \/ __| | | | '__| | __| | | | | | | | | | | | | | | |
| |___| |_| | |_) |  __/ |  ____) |  __/ (__| |_| | |  | | |_| |_| | |_| | |_| | |_| | |_| |
 \_____\__, |_.__/ \___|_| |_____/ \___|\___|\__,_|_|  |_|\__|\__, |\___/ \___/ \___/ \___/ 
        __/ |                                                  __/ |                        
       |___/                                                  |___/                 
       
       PorScanner + TopPorts -> NetCat"

	echo -e "\033[00;00m"
}

buscando()
{
        echo -e "\033[01;32m"
        echo -e "###########################################"
        echo -e "|->          Buscando Portas..          <-|"
        echo -e "###########################################"
        echo -e "\033[00;00m"
}

# Chamada de função
apres

# Programa
if [ $# != 2 ]
then
	echo "# Usage $0 <ip> <portas.txt>"
else
	buscando
	echo -e "Host -> $1\n"

	for i in $(cat $2)
	do
		cmd=$(nc -vz $1 $i 2>/dev/null)
		
		if [ $? -eq 0 ]
		then
			echo -e "\033[01;36m# Porta $i: Aberta [o]\033[00;00m"
		fi
	done
fi
